EliArad/MyDocuments/RaspberryPi3_I2C_to_kw40z/Kw40z_i2c_slave/platform/drivers/src/i2c/fsl_i2c_slave_driver.c
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];

    if(!i2cSlaveState->slaveListening)
    {
        if (i2cSlaveState->isTxBusy)
        {
            return kStatus_I2C_Busy;
        }

        /* Initialize the module driver state structure. */
        i2cSlaveState->txBuff = txBuff;
        i2cSlaveState->txSize = txSize;
        i2cSlaveState->isTxBusy = true;
        i2cSlaveState->status = kStatus_I2C_Success;

        I2C_HAL_SetIntCmd(g_i2cBase[instance], true);

        return kStatus_I2C_Success;
    }
    else /* i2cSlaveState->slaveListening */
    {
        return kStatus_I2C_Fail;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : I2C_DRV_SlaveGetTransmitStatus
 * Description   : Gets current status of I2C slave driver. This function returns
 * whether the previous I2C Slave Transmit has finished
 * When performing a non-blocking transmit, the user can call this function to
 * ascertain the state of the current transmission: in progress (or busy) or
 * complete (finished). The user can obtain the number of bytes that have been
 * currently transferred
 *
 *END**************************************************************************/
i2c_status_t I2C_DRV_SlaveGetTransmitStatus(uint32_t instance,
                                            uint32_t *bytesRemaining)
{
    assert(instance < I2C_INSTANCE_COUNT);

    /* Get current runtime structure */
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];
    i2c_status_t retVal = kStatus_I2C_Success;
    uint32_t txSize = i2cSlaveState->txSize;

    if (bytesRemaining)
    {
        *bytesRemaining = txSize;
    }

    if (txSize)
    {
        retVal = kStatus_I2C_Busy;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : I2C_DRV_SlaveGetReceiveStatus
 * Description   : Gets current status of I2C slave driver. This function returns
 * whether the previous I2C Slave Receive has finished
 * When performing a non-blocking receiving, the user can call this function to
 * ascertain the state of the current receiving: in progress (or busy) or
 * complete (finished). The user can obtain the number of bytes that have been
 * currently transferred
 *
 *END**************************************************************************/
i2c_status_t I2C_DRV_SlaveGetReceiveStatus(uint32_t instance,
                                           uint32_t *bytesRemaining)
{
    assert(instance < I2C_INSTANCE_COUNT);

    /* Get current runtime structure */
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];
    i2c_status_t retVal = kStatus_I2C_Success;
    uint32_t rxSize = i2cSlaveState->rxSize;

    if (bytesRemaining)
    {
        *bytesRemaining = rxSize;
    }

    if (rxSize)
    {
        retVal = kStatus_I2C_Busy;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : I2C_DRV_SlaveAbortReceiveData
 * Description   : This function is used to abort receiving of I2C slave
 *
 *END**************************************************************************/
i2c_status_t I2C_DRV_SlaveAbortReceiveData(uint32_t instance, uint32_t *rxSize)
{
    assert(instance < I2C_INSTANCE_COUNT);
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];

    *rxSize = i2cSlaveState->rxSize;

    /* Check if a transfer is running. */
    if (!i2cSlaveState->isRxBusy)
    {
        return kStatus_I2C_NoReceiveInProgress;
    }

    /* Stop the running transfer. */
    i2cSlaveState->isRxBusy = false;
    i2cSlaveState->rxBuff = NULL;
    i2cSlaveState->rxSize = 0;

    if(!i2cSlaveState->slaveListening)
    {
        /* Disable I2C interrupt in the peripheral.*/
        I2C_HAL_SetIntCmd(g_i2cBase[instance], false);

        if (i2cSlaveState->isRxBlocking)
        {
            /* Set kI2CSlaveRxFull event to notify that the receiving is done */
            OSA_EventSet(&i2cSlaveState->irqEvent, kI2CSlaveAbort);
        }
    }

    return kStatus_I2C_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : I2C_DRV_SlaveAbortSendData
 * Description   : This function is used to abort sending of I2C slave
 *
 *END**************************************************************************/
i2c_status_t I2C_DRV_SlaveAbortSendData(uint32_t instance, uint32_t *txSize)
{
    assert(instance < I2C_INSTANCE_COUNT);
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];

    *txSize = i2cSlaveState->txSize;

    /* Check if a transfer is running. */
    if (!i2cSlaveState->isTxBusy)
    {
        return kStatus_I2C_NoSendInProgress;
    }

    /* Stop the running transfer. */
    i2cSlaveState->isTxBusy = false;
    i2cSlaveState->txBuff = NULL;
    i2cSlaveState->txSize = 0;

    if(!i2cSlaveState->slaveListening)
    {
        /* Disable I2C interrupt in the peripheral.*/
        I2C_HAL_SetIntCmd(g_i2cBase[instance], false);

        if (i2cSlaveState->isTxBlocking)
        {
            /* Set kI2CSlaveTxEmpty event to notify that the sending is done */
            OSA_EventSet(&i2cSlaveState->irqEvent, kI2CSlaveAbort);
        }
    }

    return kStatus_I2C_Success;
}

int GetFifoInSize()
{
	if (fifo_in_read_index == fifo_in_write_index)
		return 0;

	if (fifo_in_write_index > fifo_in_read_index)
		return fifo_in_write_index - fifo_in_read_index;

	return  FIFO_IN_SIZE - fifo_in_read_index + fifo_in_write_index;
}

int GetFifoOutSize()
{
	if (fifo_out_read_index == fifo_out_write_index)
		return 0;

	if (fifo_out_write_index > fifo_out_read_index)
		return fifo_out_write_index - fifo_out_read_index;

	return  FIFO_OUT_SIZE - fifo_out_read_index + fifo_out_write_index;
}

int IsFifoInFull()
{

	int size  = GetFifoInSize();
	if (size < (FIFO_IN_SIZE - 1))
		return 0;

	return 1;

