EliArad/MyDocuments/RaspberryPi3_I2C_to_kw40z/Kw40z_i2c_slave/platform/drivers/src/i2c/fsl_i2c_slave_driver.c
}


/*FUNCTION**********************************************************************
 *
 * Function Name : I2C_DRV_SlaveIRQHandler
 * Description   : I2C Slave Generic ISR.
 * ISR action be called inside I2C IRQ handler entry.
 *
 *END**************************************************************************/
void I2C_DRV_SlaveIRQHandler(uint32_t instance)
{
    assert(instance < I2C_INSTANCE_COUNT);

    I2C_Type * base = g_i2cBase[instance];
    uint8_t  i2cData  = 0x00;
    bool     doTransmit = false;
    bool     addressed = I2C_HAL_GetStatusFlag(base, kI2CAddressAsSlave);
    bool     stopIntEnabled = false;

#if FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    bool     startDetected = I2C_HAL_GetStartFlag(base);
    bool     startIntEnabled = I2C_HAL_GetStartStopIntCmd(base);
    bool     stopDetected = I2C_HAL_GetStopFlag(base);
    stopIntEnabled = startIntEnabled;
#endif

#if FSL_FEATURE_I2C_HAS_STOP_DETECT
    bool     stopDetected = I2C_HAL_GetStopFlag(base);
    stopIntEnabled = I2C_HAL_GetStopIntCmd(base);
#endif

    /* Get current runtime structure */
    i2c_slave_state_t * i2cSlaveState = (i2c_slave_state_t *)g_i2cStatePtr[instance];

    /* Get current slave transfer direction */
    i2c_direction_t direction = I2C_HAL_GetDirMode(base);

#if FSL_FEATURE_I2C_HAS_START_STOP_DETECT
    /*--------------- Handle START ------------------*/
    if (startIntEnabled && startDetected)
    {
        I2C_HAL_ClearStartFlag(base);
        I2C_HAL_ClearInt(base);

        return;
    }
#endif

#if FSL_FEATURE_I2C_HAS_START_STOP_DETECT || FSL_FEATURE_I2C_HAS_STOP_DETECT
    /*--------------- Handle STOP ------------------*/
    if (stopIntEnabled && stopDetected)
    {
        I2C_HAL_ClearStopFlag(base);
        I2C_HAL_ClearInt(base);

        if(!i2cSlaveState->slaveListening)
        {
            /* Disable I2C interrupt in the peripheral.*/
            I2C_HAL_SetIntCmd(base, false);
        }
        return;
    }
#endif

    /* Clear I2C IRQ.*/
    I2C_HAL_ClearInt(base);

    /*--------------- Handle Address ------------------*/
    /* Addressed only happens when receiving address. */
    if (addressed) /* Slave is addressed. */
    {
        /* Master read from Slave. Slave transmit.*/
        if (I2C_HAL_GetStatusFlag(base, kI2CSlaveTransmit))
        {
            /* Switch to TX mode*/
            I2C_HAL_SetDirMode(base, kI2CSend);

            doTransmit = true;
        }
        else /* Master write to Slave. Slave receive.*/
        {
            /* Switch to RX mode.*/
            I2C_HAL_SetDirMode(base, kI2CReceive);

            /* Read dummy character.*/
            I2C_HAL_ReadByte(base);
        }
    }
    /*--------------- Handle Transfer ------------------*/
    else
    {
        /* Handle transmit */
        if (direction == kI2CSend)
        {

            if (I2C_HAL_GetStatusFlag(base, kI2CReceivedNak))
            {

                /* Switch to RX mode.*/
                I2C_HAL_SetDirMode(base, kI2CReceive);
                /* Read dummy character to release bus */
                I2C_HAL_ReadByte(base);

            }
            else /* ACK from receiver.*/
            {
                doTransmit = true;
            }
        }
        /* Handle receive */
        else
        {
            /* Get byte from data register */
            i2cData = I2C_HAL_ReadByte(base);

            if (IsFifoInFull() == 0)
            {
            	FIFO_IN[fifo_in_write_index] = i2cData;
            	fifo_in_write_index = (fifo_in_write_index + 1) % FIFO_IN_SIZE;
            } else {
            	PRINTF("fifo in full\n");
            }
        }
    }

    /* DO TRANSMIT*/
    if (doTransmit)
    {
    	if (GetFifoOutSize() == 0)
    	{
    		i2cData =  0x0;
    	} else {
    		i2cData = FIFO_OUT[fifo_out_read_index];
    		fifo_out_read_index = (fifo_out_read_index + 1) % FIFO_OUT_SIZE;
    	}
		I2C_HAL_WriteByte(base, i2cData);

    }
}

#endif /* FSL_FEATURE_SOC_I2C_COUNT */
/*******************************************************************************
 * EOF
 ******************************************************************************/
